//
//  PlayViewController.swift
//  Pantomime
//
//  Created by MahyR Sh on 4/22/23.
//

import UIKit

protocol Score_NewRoundNumberDelegate{
    func setScoreNumber() -> Int
    func newRoundNumber() -> Int
    func newCurrentIndex() -> Int
}

class PlayViewController: UIViewController {
    
    @IBOutlet weak var categoryNameLabel: UILabel!
    @IBOutlet weak var randomWordLabel: UILabel!
    @IBOutlet weak var countdownLabel: UILabel!
    @IBOutlet weak var playButton: UIButton!
    @IBOutlet weak var finishButton: UIButton!
    @IBOutlet weak var addTimeButton: UIButton!
    @IBOutlet weak var changeWordButton: UIButton!
    
    var delegate: CategoryNameDelegate?
    var countdownTimer: Timer?
    var changeWordButtonFlag = 0
    var scoreResultNumber = 3
    var timer = 0
    
    var animaladjectivesArray = [ "بزرگ", "کوچک", "قوی", "ضعیف", "شیرین", "خشن", "سریع", "آهسته", "زیبا", "شجاع", "خجالتی", "بی‌خطر", "ترسو", "بی‌صدا", "صداگون", "فراری", "اهلی", "وحشی", "انعطاف‌پذیر", "بی‌انعطاف", "مهربان", "بی‌رحم", "شیطان", "بی‌گناه", "خون‌خوار", "نبات‌خوار", "شکارچی", "آرام", "پرانرژی", "خواب‌آلود", "بی‌اعتماد", "مطیع", "متمرد", "هوشمند", "بی‌هوش", "بی‌رنگ", "چشم‌انداز", "درخشان", "مات", "بی‌بو", "بوبر", "با‌بو", "بدبو", "رنگارنگ", "پوشیده", "بی‌پوش", "نر", "ماده", "جوان", "پیر", "پرفروش", "بی‌فروش", "شاداب", "خسته", "سالم", "بیمار", "گرسنه", "سیر", "پرکار", "بیکار", "موفق", "ناکام", "خوش‌شانس", "بدشانس", "خوش‌تیپ", "بدتیپ", "مهم", "بی‌مهم", "محبوب", "ناپسندیده", "شهری", "روستایی", "امیدوار", "ناامید", "مرد", "زن", "قد بلند", "قد کوتاه", "کشاورز", "شکارچی", "دوست‌داشتنی", "ناخوشایند", "همراه", "تنها", "خانگی", "وحشی", "هوشیار", "بی‌هوش", "بی‌صدا", "صدابرم", "بی‌حرکت", "عصبی", "آروم", "سریع", "آهسته", "مهارکننده", "بی‌مهار", "موثر", "بی‌اثر", "متعادل", "عدالتخواه", "بی‌عدالت", "دلیر", "ترسو", "مؤمن", "کافر", "متناقض", "منضبط", "بی‌انضباط", "کنجکاو", "بی‌کنجکاو", "معتدل", "بی‌عقل", "دارای‌عقل","سنگین", "سبک", "خوشمزه", "تلخ", "شیرین", "تند", "کهنه", "جدید",   "درخشان", "کدر", "پر", "خالی", "عالی", "بد", "آرام", "پر سر و صدا",
        "روشن", "تاریک", "گرم", "سرد", "مرطوب", "خشک", "سخت", "آسان", "کند", "پرانرژی", "خسته", "شاد", "غمگین", "خوشحال", "ناراحت", "راضی",
    ]
    var animalArray = [
        "ورانگوتان", "سیمرغ", "حلزون", "آهوی وحشی", "کوالا خسته", "الاغ کد خدا", "اسب آبی",
        "شیر دریایی", "سگ آبی", "عروس دریایی", "کوسه سر چشکی", "وال سفید", "مورچه خوار",
        "مرغ آمین", "سگ اقای پتیبل", "ققنوس", "گرگینه", "خر شرک", "پلنگ صورتی",
        "اسب لوک خوش شانس", "کرم خاکی", "سوسک فاضلاب", "مار هفت خط", "جغد شاخدار",
        "شتر مرغ", "مورچه آدم خوار", "ماهی گوشت خوار", "شقایق دریایی", "عقاب ماهی خوار",
        "سنجاب", "سگ", "خوک", "شیر نر", "موش", "میمون", "فیل", "روباه", "پاندا", "کانگورو",
        "گاو", "پلنگ", "کایوت", "جوجه تيغي", "شامپانزه", "گراز دریایی", "بز", "کوالا", "اسب ابی",
        "گوسفند", "راکون", "ورزا", "سمور", "اسب", "موش کور", "زرافه", "آهو", "خرگوش", "لاک پشت",
        "ماهی", "موش", "همستر", "آفتابپرست", "کبوتر", "طوطی", "مار", "وال آبی", "کوسه", "ماهی",
        "پنگوئن", "دلفین", "اختاپوس", "فوک دریایی", "شیر دریایی", "خرچنگ", "پیرانا", "اسب دریایی",
        "ماهی قرمز", "گراز دریایی", "میگو", "گربه ماهی", "عقاب", "کبوتر", "طاووس", "کلاغ",
        "گنجشک", "طوطی", "جغد", "قو", "خفاش", "شترمرغ", "دارکوب", "درنا", "شاه ماهی", "اردک",
        "مرغ مقلد", "قو", "پنگوئن", "بوقلمون", "خروس", "کرکس", "مارمولک", "عنکبوت", "پشه",
        "زنبور عسل", "مورچه", "سوسک", "هزار پا", "عقرب", "کرم ابریشم", "پروانه", "ملخ", "کفشدوزک"
    ]
    var objectArray = [
        "میز", "صندلی", "لپ‌تاپ", "تلفن", "کتاب", "فنجان", "چراغ", "کیف",
        "ساعت", "عینک", "کلید", "تلویزیون", "دوربین", "ماشین", "دوچرخه", "تخت",
        "ساعت دیواری", "قاب عکس", "آینه", "پرده", "فرش", "گلدان", "قاشق", "چنگال",
        "کارد", "بشقاب", "کاسه", "قوری", "برس", "شانه", "موبایل", "تبلت",
        "کیبورد", "موس", "هدفون", "اسپیکر", "کتابخانه", "شلف", "جعبه", "ساک"
    ]
    var objectAdjectiveArray = [
        "قلقلک‌دهنده", "شیطون", "خنده‌دار", "پر جنب و جوش", "دیوانه‌وار", "عجیب و غریب",
        "فانتزی", "اسرارآمیز", "غیرمعمولی", "موزون", "شنگول", "پیچیده", "فضایی", "شلوغ‌پلوغ",
        "آوازخوان", "درخشان", "وزوزکننده", "پر سر و صدا", "خودنمایی", "پر از شیطنت",
        "پر انرژی", "متحرک", "رنگارنگ", "چشمک‌زن", "پرت و پلا", "بازیگوش", "خیال‌انگیز",
        "پر از آواز", "مرموز", "پر از حرکت"
    ]
    var foodAdjectivesArray = [
        "خوشمزه", "ترد", "شور", "شیرین", "تند", "معطر", "خنک", "گرم",
        "سرد", "کرمی", "چرب", "سبک", "سنگین", "تازه", "بازپخته", "کهنه",
        "خام", "پخته", "نرم", "سفت", "ریز", "درشت", "لذیذ", "ملایم",
        "زیرکوب شده", "خرد شده", "آسیاب شده", "مرینت شده", "بخارپز",
        "سرخ شده", "آب‌پز", "کبابی", "بدون نمک", "با نمک", "مزه‌دار",
        "خوشمزه", "تازه", "عالی", "لذت بخش", "متنوع", "سبک و سالم", "کامل", "غنی", "خوش رنگ", "آروم‌بخش", "اصیل", "متعادل", "نیمه آماده", "شیک", "پربار", "عطری", "نرم و لطیف", "دسری", "خنک", "گرم", "خوش‌خوراک", "خوشمزه‌تر از چهره‌اش", "خوشمزه‌تر از گزاف‌گویی‌اش", "بدون چربی", "بدون گلوتن", "بدون لاکتوز", "بدون شکر", "بدون افزودنی‌های مصنوعی", "بدون نمک اضافی", "بدون رنگ اضافی", "سنتی", "ابتکاری", "خوشاقعاده", "طعم‌دهنده", "روغنی", "گوشتی", "گیاهی", "دریایی", "ساده", "معطر", "کرمی", "اسپایسی", "شیرین", "تند", "ترش", "شور", "خوشمزه‌ی محلی", "ارگانیک", "بدون گیاهان معطر", "مزه‌دهنده"
    ]
    var foodArray = [
        "پیتزا", "ساندویچ", "پاستا", "برگر", "سوشی", "کباب", "استیک", "سالاد",
        "سوپ", "ریزوتو", "تاکو", "بوریتو", "فلافل", "همبرگر", "چیپس", "پاپکورن",
        "دونات", "شیرینی", "کیک", "بستنی", "موساکا", "پیراشکی", "سمبوسه", "کوکوسبزی",
        "آش رشته", "قرمه سبزی", "پلو", "چلو کباب", "باقالی پلو", "خورشت فسنجان",
        "لوبیا پلو", "ته چین", "خوراک لوبیا", "ماکارونی", "لازانیا", "فتوچینی",
        "ناگت مرغ", "استراگانف", "گوگل موگل", "استامبولی پلو", "کتلت", "کوفته",
        "تبوله", "حمص", "موهیتو", "کوکتل میوه", "اسموتی", "آبمیوه", "شربت", "چای"
    ]
    var categoryFootballArray = [
        "لیونل مسی", "کریستیانو رونالدو", "نیمار", "کیلیان امباپه", "محمد صلاح",
        "ویرجیل فن دایک", "کوین دی بروین", "روبرت لواندوفسکی", "سرخیو راموس", "سادیو مانه",
        "الکساندر آرنولد", "برناردو سیلوا", "فرانکی دی یونگ", "هری کین", "رحیم استرلینگ",
        "جانلوئیجی دوناروما", "جورجینیو", "روملو لوکاکو", "نگولو کانته", "جوردن هندرسون",
        "پپ گواردیولا", "یورگن کلوپ", "ژوزه مورینیو", "دیگو سیمئونه", "زین‌الدین زیدان",
        "آنتونیو کونته", "کارلو آنچلوتی", "مائوریتزیو ساری", "توماس توخل", "هانسی فلیک",
        "ماسیمیلیانو آلگری", "اونای امری", "لوئیس انریکه", "گرت ساوت‌گیت", "رونالد کومان",
        "فرانک لمپارد", "استیون جرارد", "ارنستو والورده", "میکل آرتتا", "جولن لوپتگی",
        "کارلوس کی‌روش", "برانکو ایوانکوویچ", "علی دایی", "امیر قلعه‌نویی", "فرهاد مجیدی", "یحیی گل‌محمدی" , "علی کریمی", "مهدی ترابی", "سردار آزمون", "علیرضا جهانبخش", "مهرداد محمدی", "کریم انصاری‌فرد", "علیرضا بیرانوند", "مهدی طارمی", "سید جلال حسینی","ورزشگاه ومبلی", "ورزشگاه کمپ نو", "ورزشگاه سانتیاگو برنابئو", "ورزشگاه آلیانتس آرنا", "ورزشگاه اولد ترافورد", "ورزشگاه استادیوم آزتکا","گل", "کرنر", "آفساید", "پنالتی", "دریبل", "تکل",
        "کارت زرد", "کارت قرمز", "هافبک", "مهاجم", "دفاع",
        "کلین شیت", "هدر", "کراس", "سیو", "وینگر", "اوت",
        "داور", "لیگ", "ترکیب تیم", "مربی", "تعویض", "ضربه آزاد","پرسپولیس", "استقلال", "تراکتور", "سپاهان", "فولاد خوزستان", "ذوب آهن اصفهان", "پیکان", "سایپا", "گل‌گهر سیرجان", "نفت مسجد سلیمان","رئال مادرید", "بارسلونا", "منچستر یونایتد", "لیورپول", "بایرن مونیخ", "پاری سن ژرمن", "یوونتوس", "آث میلان", "اینتر میلان", "آژاکس", "بوکا جونیورز", "ریور پلاته", "فلامنگو", "الاهلی", "گوانگژو اورگرانده", "چلسی", "آرسنال", "اتلتیکو مادرید", "بوروسیا دورتموند", "تاتنهام هاتسپر", "فابیان بارتز", "مهدی مهدوی‌کیا", "جواد نکونام", "ایمان مبعلی",
        "کریم باقری", "مهدی ترابی", "اشکان دژاگه", "علیرضا جهانبخش",
        "آرش رضاوند", "مرتضی پورعلی‌گنجی", "احسان حاج‌صفی",
        "مهرداد میناوند", "علی پروین", "حسین کعبی", "رضا قوچان‌نژاد",
        "محرم نویدکیا", "وحید هاشمیان", "امیر عابدزاده", "محمد خاکپور",
        "پیروز قربانی"
    ]
    var categorySportArray = [
        "فوتبال", "بسکتبال", "والیبال", "تنیس", "پینگ‌پونگ",
        "بدمینتون", "شنا", "دو و میدانی", "ژیمناستیک", "اسکی",
        "اسنوبورد", "اسکیت‌بورد", "دوچرخه‌سواری", "موتورسواری", "اتومبیل‌رانی",
        "بوکس", "کشتی", "جودو", "تکواندو", "کاراته",
        "فنسینگ", "تیراندازی", "کمانداری", "اسب‌سواری", "پولو",
        "گلف", "راگبی", "کریکت", "هاکی", "فوتبال آمریکایی",
        "بیسبال", "سافتبال", "هندبال", "واترپولو", "سوارکاری",
        "پاراگلایدینگ", "دلتاپلان", "پاراشوت‌سواری", "غواصی", "ماهیگیری",
        "یوگا", "پیلاتس", "بادی‌بیلدینگ", "پاورلیفتینگ", "کراس‌فیت",
        "ایروبیک", "دنس", "رقص باله", "اسکواش", "راکتبال",
        "بولینگ", "بیلیارد", "شطرنج", "بریج", "پوکر",
        "دارت", "کوهنوردی", "صخره‌نوردی", "غارنوردی", "رفتینگ",
        "قایقرانی", "موج‌سواری", "اسکی روی آب", "موج‌سواری با بادبان", "اسکیت روی یخ",
        "هاکی روی یخ", "پاتیناژ", "باب‌اسلای", "لوژ", "اسکی کراس‌کانتری",
        "بیاتلون", "سه‌گانه", "پنج‌گانه مدرن", "هپتاتلون", "دکاتلون",
        "کرلینگ", "بوچیا", "پتانک", "فریزبی", "فریزبی گلف",
        "فوتبال رباتیک", "شمشیربازی", "اسکیمو رول", "سومو", "مبارزه تایلندی",
        "کیک‌بوکسینگ", "موی تای", "سیلات", "کپوئرا", "ایکیدو",
        "جوجیتسو", "هاپکیدو", "کونگ‌فو", "ووشو", "تای‌چی",
        "کین‌دو", "لیدو", "نینجوتسو", "فلاوربال", "بازی‌های رزمی مختلط"
    ]
    var categoryMovieArray = [
        "رستگاری در شاوشنک", "پدرخوانده", "شوالیه تاریکی", "پدرخوانده قسمت دوم",
        "۱۲ مرد خشمگین", "لیست شیندلر", "داستان عامه‌پسند", "ارباب حلقه‌ها: بازگشت پادشاه",
        "خوب، بد، زشت", "باشگاه مشت‌زنی", "فارست گامپ", "تلقین",
        "ارباب حلقه‌ها: یاران حلقه", "جنگ ستارگان: امپراتوری ضربه می‌زند",
        "ارباب حلقه‌ها: دو برج", "ماتریکس", "رفقای خوب", "پرواز بر فراز آشیانه فاخته",
        "هفت", "زندگی زیباست", "راه‌های شهرت", "جنگ ستارگان: بازگشت جدای",
        "بازی‌های ذهنی", "دوازده میمون", "فیلم بزرگ", "پدرخوانده قسمت سوم",
        "بتمن شروع می‌کند", "رفتگان", "مردان ایکس", "مردان سیاه‌پوش",
        "خانواده سیمپسون‌ها", "دوستان", "بریکینگ بد", "گیم آو ترونز",
        "استرنجر تینگز", "بیگ بنگ تئوری", "هاوس", "گریز از زندان",
        "مردگان متحرک", "دکستر", "سوپرنچرال", "وایکینگ‌ها",
        "نارکوس", "شرلوک", "تئوری انفجار بزرگ", "آینه سیاه",
        "فرگیلی", "آمریکن هورر استوری", "دردویل", "پیکی بلایندرز",
        "تاج", "دروغ‌های کوچک بزرگ", "هندمیدز تیل", "بانشی",
        "ترو دتکتیو", "وست ورلد", "بهتره با ساول تماس بگیری", "فارگو",
        "دیسنچنتد", "ریک و مورتی", "بروکلین نه‌نه", "نمایش کراون",
        "ترون‌های یخی", "کارآگاه گجت", "آواتار: آخرین بادافزار", "گراویتی فالز",
        "استیون یونیورس", "ماجراهای تین‌تین", "اسمورف‌ها", "پینوکیو",
        "در جستجوی نمو", "شیرشاه", "علاءالدین", "مولان",
        "زیبای خفته", "سفیدبرفی و هفت کوتوله", "سیندرلا", "پوکاهانتس",
        "هرکول", "دامبو", "بامبی", "فانتازیا",
        "پیتر پن", "جیمز و هلوی غول‌پیکر", "داستان اسباب‌بازی‌ها", "شرک",
        "آناستازیا", "پری دریایی کوچک", "راپانزل", "موآنا",
        "فروزن", "سینمای پارادیزو", "دونی براسکو", "کازینو",
        "راننده تاکسی", "گاو خشمگین", "آخرین تانگو در پاریس", "آرماگدون", "جدایی نادر از سیمین", "گبه", "درباره الی", "بچه‌های آسمان",
        "بادیگارد", "آژانس شیشه‌ای", "کمال‌المولک", "روز واقعه",
        "محمد رسول‌الله", "مارمولک", "طعم گیلاس", "خانه دوست کجاست",
        "سنتوری", "آبادان", "خوابگاه دختران", "قلاده‌های طلا",
        "شب‌های برره", "نرگس", "چهارشنبه‌سوری", "باران",
        "قصه‌ها", "کلاه قرمزی و پسرخاله", "پایتخت", "شهرزاد",
        "مختارنامه", "روزگار قریب", "دایره مینا", "مرد هزارچهره",
        "زیر آسمان شهر", "خانه سبز", "همسران", "مادر",
        "آرایش غلیظ", "ساخت ایران", "شاهگوش", "پاورچین",
        "قهوه تلخ", "پرده‌نشین", "عمارت فرنگی", "هوش سیاه",
        "نون خ", "کلاه پهلوی", "معمای شاه", "زیر پای مادر",
        "جمعه‌ای در میان", "دوران کهن", "چرخ فلک", "سرزمین کهن",
        "میوه ممنوعه", "دزد و پلیس"
    ]
    var categoryJobArray = [
        "مهندس نرم‌افزار", "پزشک", "دندانپزشک", "معمار",
        "مهندس برق", "مهندس مکانیک", "وکیل", "حسابدار",
        "معلم", "استاد دانشگاه", "روانشناس", "داروساز",
        "پرستار", "بازیگر", "کارگردان", "نویسنده",
        "خبرنگار", "مجری تلویزیون", "عکاس", "طراح گرافیک",
        "نقاش", "موسیقیدان", "خواننده", "رقاص",
        "مدیر فروش", "کارشناس بازاریابی", "مترجم", "راهنمای تور",
        "مهندس عمران", "مهندس صنایع", "مهندس کامپیوتر", "مهندس شیمی",
        "مهندس نفت", "مهندس هوافضا", "مهندس کشاورزی", "مهندس معدن",
        "مدیر پروژه", "برنامه‌ریز شهری", "کارشناس ارتباطات", "روزنامه‌نگار",
        "تدوینگر", "فیلمبردار", "طراح صحنه", "طراح لباس",
        "آشپز", "قناد", "گرافیست", "متخصص IT",
        "مدیر IT", "مهندس سیستم", "تحلیلگر داده", "مدیر داده",
        "متخصص امنیت سایبری", "متخصص شبکه", "کارشناس فناوری اطلاعات", "برنامه‌نویس",
        "مدیر تولید", "کارگر کارخانه", "کارشناس کیفیت", "کارشناس ایمنی",
        "مدیر کارخانه", "مهندس تولید", "مهندس برنامه‌ریزی تولید", "مدیر عملیات",
        "مشاور مدیریت", "مدیر منابع انسانی", "مدیر مالی", "مدیر بازرگانی",
        "مدیر اجرایی", "مدیر عامل", "کارآفرین", "کارشناس فروش",
        "نماینده فروش", "مدیر فروش منطقه‌ای", "مدیر بازاریابی", "متخصص بازاریابی دیجیتال",
        "متخصص سئو", "کارشناس رسانه‌های اجتماعی", "طراح وب", "توسعه‌دهنده وب",
        "متخصص UX/UI", "کارشناس پشتیبانی وب", "بلاگر", "نویسنده محتوا",
        "کارشناس امور مشتریان", "مدیر خدمات مشتری", "کارشناس پشتیبانی مشتری", "کارشناس پشتیبانی فنی",
        "مهندس پشتیبانی فنی", "تکنسین", "مکانیک", "تکنسین الکترونیک",
        "تکنسین کامپیوتر", "تکنسین شبکه", "مهندس پزشکی", "متخصص ارتوپدی",
        "متخصص قلب و عروق", "متخصص چشم", "متخصص اطفال", "متخصص زنان و زایمان",
        "متخصص پوست", "متخصص گوش، حلق و بینی", "متخصص مغز و اعصاب", "جراح عمومی",
        "جراح پلاستیک", "جراح قلب", "جراح مغز و اعصاب", "متخصص بیهوشی",
        "پاتولوژیست", "رادیولوژیست", "سونوگرافیست", "ماما",
        "کارشناس بهداشت", "متخصص تغذیه", "متخصص فیزیوتراپی", "کایروپراکتور",
        "استادیار", "دانشیار", "پروفسور", "مدرس زبان",
        "معلم دبستان", "معلم راهنمایی", "معلم دبیرستان", "مربی ورزشی",
        "مربی کودک", "مربی مهد کودک", "مربی تیم ورزشی", "مربی شنا",
        "مربی بدنسازی", "مربی یوگا", "مربی رقص", "مربی هنرهای رزمی",
        "مربی اسب‌سواری", "مربی اسکی", "مربی تنیس", "مربی گلف",
        "مربی بسکتبال", "مربی فوتبال", "مربی والیبال", "مربی پینگ‌پنگ",
        "مربی بدمینتون", "مربی دوچرخه‌سواری", "مربی بوکس", "مربی کشتی",
        "مربی جودو", "مربی تکواندو", "مربی کاراته", "مربی فنسینگ",
        "مربی تیراندازی", "مربی کمانداری", "مربی اسب‌سواری", "مربی پولو"
    ]
    var categoryPlaceArray = [
        "تخت جمشید", "باغ ارم شیراز", "کاخ گلستان", "مسجد نصیرالملک",
        "کویر مرنجاب", "دریاچه ارومیه", "جنگل‌های هیرکانی", "ماسوله",
        "بازار تبریز", "موزه ملی ایران", "آبشار مارگون", "روستای ابیانه",
        "غار علیصدر", "دریاچه گهر", "جزیره کیش", "چشمه باداب سورت",
        "کوه دماوند", "قلعه بم", "مجموعه وکیل", "حمام وکیل",
        "کاخ چهلستون", "میدان نقش جهان", "کویر لوت", "کلوت‌های شهداد",
        "پل خواجو", "برج آزادی", "برج میلاد", "قلعه فلک‌الافلاک",
        "دریاچه نئور", "پل ورسک", "سی‌وسه پل", "مجموعه سعدآباد",
        "پارک ملی گلستان", "کاخ نیاوران", "کوه توچال", "آرامگاه حافظ",
        "آرامگاه سعدی", "حافظیه", "سعدیه", "آرامگاه فردوسی",
        "باغ فین کاشان", "مسجد شیخ لطف‌الله", "مسجد جامع اصفهان", "کاخ عالی‌قاپو",
        "پرسپولیس", "میدان مشق", "کاخ مروارید", "کاخ نیاوران",
        "برج آزادی", "برج میلاد", "برج دختر", "قلعه رودخان",
        "آرامگاه خیام", "آرامگاه عطار", "آرامگاه مولانا", "پاسارگاد",
        "قلعه فلک‌الافلاک", "باغ دلگشا", "کاخ آپادانا", "کاخ هشت‌بهشت",
        "موزه هنرهای معاصر", "موزه ملی ایران", "موزه جواهرات ملی", "کوه الوند",
        "جزیره قشم", "جزیره هرمز", "پل خشتی کرج", "مقبره‌الشعرا",
        "دریاچه چیتگر", "پارک جمشیدیه", "پارک ساعی", "پارک ارم",
        "پارک لاله", "پارک آب و آتش", "باغ موزه قصر", "باغ موزه دفاع مقدس",
        "استادیوم آزادی", "موزه فرش", "موزه رضا عباسی", "حرم امام رضا",
        "حرم حضرت معصومه", "حرم شاهچراغ", "کاخ مرمر", "موزه ملی قرآن کریم",
        "برج قابوس", "خانه طباطبایی‌ها", "خانه عباسیان", "کاروانسرای مرنجاب",
        "دریاچه اوان", "غار کتله‌خور", "غار چال نخجیر", "کاخ هشت‌بهشت اصفهان",
        "کاخ موزه نیاوران", "کاخ سعدآباد", "منطقه گردشگری بندر انزلی", "دریاچه پریشان",
        "دریاچه سد کرج", "دریاچه زریوار", "جزیره هنگام", "جزیره لاوان",
        "جزیره هندورابی", "جزیره لارک", "شهر زیرزمینی نوش‌آباد", "شهر تاریخی شوش",
        "شهر تاریخی همدان", "شهر تاریخی کرمان", "شهر تاریخی یزد", "شهر تاریخی اصفهان",
        "شهر تاریخی کاشان", "شهر تاریخی نیشابور", "شهر تاریخی تبریز", "شهر تاریخی قزوین"
    ]
    var categoryBookArray = [
        "دیوان حافظ", "شاهنامه فردوسی", "مثنوی معنوی", "گلستان سعدی",
        "بوستان سعدی", "کلیات شمس تبریزی", "دیوان خیام", "رباعیات عطار",
        "چشم‌هایش", "بوف کور", "سووشون", "کلیدر",
        "سمفونی مردگان", "جای خالی سلوچ", "کتاب اشعار فروغ فرخزاد", "سال بلوا",
        "قصه‌های مجید", "سفرنامه ناصر خسرو", "دلیران تنگستان", "تاریخ بیهقی",
        "باغ وحش پدری", "جنوب بدون ابریشم", "همسایه‌ها", "عصیان",
        "انتظار بی‌پایان", "آن سوی مرگ", "عقاید یک دلقک", "دنیای سوفی",
        "بیگانه", "آدمک‌ها", "آینه‌های ناگهان", "خاله بازی",
        "سفر به انتهای شب", "پیرمرد و دریا", "گرگ و میش", "بی‌نهایت جادویی",
        "در جستجوی زمان از دست رفته", "قلعه حیوانات", "۱۹۸۴", "برف‌های کلیمانجارو",
        "مردی بدون سرزمین", "جنگ و صلح", "آنا کارنینا", "جرم و مکافات",
        "کوری", "کتابخانه نیمه‌شب", "در کافه‌ی ادبیات", "مرگ سعادت",
        "شازده کوچولو", "پرواز شبانه", "سرگذشت نارنیا", "هابیت",
        "ارباب حلقه‌ها", "هری پاتر و سنگ جادو", "هری پاتر و تالار اسرار",
        "هری پاتر و زندانی آزکابان", "هری پاتر و جام آتش", "هری پاتر و محفل ققنوس",
        "هری پاتر و شاهزاده دورگه", "هری پاتر و یادگاران مرگ", "داستان دو شهر",
        "مرگ در ونیز", "کازینو رویال", "خانه‌ای در تپه", "درختان می‌رویند در بروکلین",
        "رمان فرانکشتاین", "دراکولا", "جکیل و هاید", "کالیگولا",
        "کیمیاگر", "مردی به نام اوه", "دیوید کاپرفیلد", "مزرعه حیوانات",
        "سقوط", "بلندی‌های بادگیر", "گتسبی بزرگ", "تسلیم",
        "مهمان‌نوازی کنیزی", "زندگی در پیش رو", "کتاب زرد", "آبی عمیق تیره",
        "موبی دیک", "اولیور توئیست", "شیرینی پنهان", "گربه روی شیروانی داغ",
        "مسافران شب", "جایی دور از اینجا", "سه تفنگدار", "دون کیشوت",
        "قمارباز", "اشراق", "فرار از کمپ ۱۴", "آواز پر جبرئیل",
        "رباعیات عمر خیام", "محاکمه", "کافکا در کرانه", "تاریخ زندگی خودم",
        "آشوب", "آخرین ایستاده", "دونده هزارتو", "بی‌صدا فریاد کن",
        "بازمانده روز", "دختری در قطار", "مردان بی‌زن", "جادوگر شهر اُز",
        "زندانی زندا", "سفرنامه ابن بطوطه", "خرمگس", "مرثیه‌ای برای یک رویا",
        "مرگ در میان زندگی", "مرگ در آبشار", "بینوایان", "فرشتگان و شیاطین",
        "کد داوینچی", "معبد زمردین", "کتاب مردگان", "فرزندان حاج آقا",
        "کلاغ سفید", "جنگل‌های نوردمرک", "بازی تاج و تخت", "نبرد زمستان",
        "شبح اپرا", "رمان مونت کریستو", "نامه‌های عاشقانه از یک فیلسوف",
        "پنجره‌ای به جهان دیگر", "کشتی گیلگمش", "هزار خورشید تابان",
        "پیرمردی که از پنجره بیرون پرید و ناپدید شد", "آتش بدون دود",
        "جنگجوی آرام", "آسمان همیشه آبی نیست", "مردی با بال‌های بزرگ",
        "شهری چون بهشت", "رقص در گرداب", "سرزمین گمشده", "کشف معبد","اهرام ثلاثه مصر", "تاج محل هند", "دیوار بزرگ چین", "کلوسئوم رم",
        "ماچو پیچو پرو", "پترا اردن", "کاخ ورسای فرانسه", "آکروپولیس یونان",
        "آنگکور وات کامبوج", "استون‌هنج انگلستان", "کاخ بلوم پترزبورگ",
        "قصر الحمرا اسپانیا", "کاخ پوتالا تبت", "قلعه نویشوانشتاین آلمان",
        "مونت سنت میشل فرانسه", "کاخ باکینگهام انگلستان", "کاخ سفید آمریکا",
        "برج ایفل فرانسه", "مجسمه آزادی آمریکا", "کاخ کرملین روسیه",
        "ساگرادا فامیلیا اسپانیا", "برج پیزا ایتالیا", "برج بیگ بن انگلستان",
        "کاخ توپکاپی استانبول", "کاخ پارلمان بوداپست", "سنت پیترزبورگ روسیه",
        "قلعه هوهنزولرن آلمان", "کاخ وینتر پالاس روسیه", "قلعه ادینبرو اسکاتلند",
        "کاخ وینچستر آمریکا", "قلعه بران رومانی", "کاخ سانسوسی آلمان",
        "کاخ شونبرون اتریش", "کاخ مدرید اسپانیا", "قلعه چنونسو فرانسه",
        "کاخ دوجه ونیز ایتالیا", "کاخ ورسای فرانسه", "کاخ دوکاله ونیز",
        "کاخ سلطان احمد استانبول", "کاخ شاهی اسکاتلند", "کاخ گلدنبورگ دانمارک",
        "کاخ سنت جیمز انگلستان", "برج لندن انگلستان", "کاخ هلسینگور دانمارک",
        "کاخ ملکه الیزابت لندن", "کاخ رویال پالاس استکهلم", "کاخ واتیکان",
        "کاخ برلین آلمان", "کاخ پلازا مایور مادرید", "کاخ کاتدرال میلان",
        "کاخ دولماباغچه استانبول", "قلعه چاتو دو شامبورد فرانسه",
        "کاخ نئوشوانشتاین آلمان", "قلعه چنبریج انگلستان", "کاخ پراگ چک",
        "کاخ ملی پنا پرتغال", "کاخ سیتی هال بلژیک", "کاخ مورالیتا ایتالیا",
        "قلعه کوراکوئو ژاپن", "کاخ اپرای پاریس فرانسه", "کاخ بلود پالاس روسیه",
        "قلعه هایدلبرگ آلمان", "کاخ شهریاری ونیز", "کاخ پارلمان اوتاوا کانادا",
        "کاخ ملی سینترا پرتغال", "قلعه هوهنزالرن آلمان", "کاخ مونترال کانادا",
        "کاخ سیتی هال وین", "کاخ شهری لیوبلیانا اسلوونی", "کاخ ناسیونال اسپانیا"
    ]
    var categoryMusicArray = [
        "محمدرضا شجریان", "پرویز مشکاتیان", "شهرام ناظری",
        "مرجان", "بنان", "سیمین غانم", "هایده", "گوگوش",
        "ابی", "داریوش", "معین", "فرهاد", "شهره", "لیلا فروهر",
        "آرتوش", "سوسن", "فریدون فروغی", "حسین علیزاده", "کیهان کلهر",
        "همایون شجریان", "سالار عقیلی", "علیرضا افتخاری", "محسن چاوشی",
        "محمد اصفهانی", "رضا صادقی", "سیروان خسروی",
        "سنتور", "تار", "سه‌تار", "دف", "تنبک", "قانون", "کمانچه",
        "نی", "باربط", "رباب", "ساز", "سنتور دیوان", "دوتار",
        "غیچک", "کرنا", "سرنا", "بم‌تار", "شورانگیز", "چنگ",
        "لودویگ فان بتهوون", "وولفگانگ آمادئوس موتسارت", "یوهان سباستیان باخ",
        "فردریک شوپن", "پیوتر ایلیچ چایکوفسکی", "جرج فریدریک هندل",
        "یوهانس برامس", "ریچارد واگنر", "گوستاو مالر", "فرانتس شوبرت",
        "جوزپه وردی", "جیاکومو پوچینی", "کلود دبوسی", "موریس راول",
        "سرگئی راخمانینوف", "آرون کوپلند", "لئونارد برنستاین", "جان ویلیامز",
        "انریکو کاروسو", "لوچیانو پاواروتی", "ماریا کالاس", "آندره بوچلی",
        "سلین دیون", "ویتنی هوستون", "مایکل جکسون", "الویس پریسلی",
        "باب دیلن", "دیوید بووی", "فردی مرکوری", "جان لنون",
        "پیانو", "ویولن", "ویولنسل", "فلوت", "گیتار", "درامز",
        "ساکسیفون", "ترومپت",
       "اکوردئون",
       "الکتریک گیتار",
    ]
    var categoryCountryCityArray = [
        "افغانستان", "آلمان", "آرژانتین", "استرالیا", "اتریش",
        "بلژیک", "برزیل", "کانادا", "چین", "دانمارک",
        "مصر", "فنلاند", "فرانسه", "یونان", "هند",
        "اندونزی", "ایران", "عراق", "ایرلند", "ایتالیا",
        "ژاپن", "اردن", "کنیا", "کویت", "لبنان",
        "مالزی", "مکزیک", "مغولستان", "مراکش", "نپال",
        "هلند", "نیوزیلند", "نیجریه", "نروژ", "عمان",
        "پاکستان", "پرو", "فیلیپین", "لهستان", "پرتغال",
        "قطر", "رومانی", "روسیه", "عربستان سعودی", "سنگاپور",
        "کره جنوبی", "اسپانیا", "سریلانکا", "سوئد", "سوئیس","تهران", "نیویورک", "توکیو", "لندن", "پاریس",
        "مسکو", "بیجینگ", "دوبی", "استانبول", "سیدنی",
        "روم", "برلین", "مادرید", "مونترال", "تورنتو",
        "سنگاپور", "هنگ کنگ", "مومبای", "دلی", "بانکوک",
        "سئول", "شانگهای", "کوالالامپور", "جاکارتا", "کیپ تاون",
        "کایرو", "لاس وگاس", "سان فرانسیسکو", "شیکاگو", "میامی",
        "آمستردام", "بروکسل", "وین", "زوریخ", "اوسلو",
        "کپنهاگ", "استکهلم", "هلسینکی", "پراگ", "وارشو",
        "بوداپست", "دوبلین", "ادینبرگ", "گلاسکو", "لیورپول",
        "منچستر", "بیرمنگام", "لیدز", "بریستول", "شفیلد",
        "کاردیف", "بلفاست", "نیوکاسل", "ساتهمپتون", "نوریچ",
        "باث", "اکسفورد", "کمبریج", "یورک", "برایتون",
        "بورنموث", "پلیموث", "لستر", "ناتینگهام", "دورهام",
        "اینورنس", "آبردین", "داندی", "پرت", "گلاسگو", "اندیمشک", "اصفهان", "شیراز", "مشهد", "تبریز",
        "کرمانشاه", "ارومیه", "رشت", "قم", "اهواز",
        "یزد", "کرمان", "همدان", "ساری", "اردبیل",
        "زنجان", "سنندج", "قزوین", "کاشان", "گرگان",
        "بندرعباس", "ایلام", "بوشهر", "خرم‌آباد", "دزفول",
        "رفسنجان", "کاشمر", "مراغه", "نیشابور", "بابل",
        "سمنان", "شهرکرد", "گنبد کاووس", "محلات", "ورامین",
        "اراک", "بروجرد", "خوی", "دامغان", "زاهدان"
    ]
    var categoryCelebrityArray = [
        "عزت‌الله انتظامی", "بهروز وثوقی", "فردین", "ناصر ملک‌مطیعی",
        "علی نصیریان", "جمشید مشایخی", "محمدعلی فردین", "رضا کیانیان",
        "پرویز پرستویی", "لیلا حاتمی", "گلشیفته فراهانی", "ترانه علیدوستی",
        "هدیه تهرانی", "مهناز افشار", "نیکی کریمی", "شهاب حسینی",
        "پیمان معادی", "لادن مستوفی", "رخشان بنی‌اعتماد", "بهرام رادان",
        "مرلین مونرو", "مارلون براندو", "جیمز دین", "آل پاچینو",
        "رابرت دنیرو", "جک نیکلسون", "داستین هافمن", "تام هنکس",
        "مریل استریپ", "کیت وینسلت", "آنجلینا جولی", "برد پیت",
        "لئوناردو دی‌کاپریو", "جانی دپ", "مورگان فریمن", "دنزل واشنگتن",
        "کلینت ایستوود", "هیو جکمن", "کریستین بیل", "رایان گاسلینگ",
        "کیانو ریوز", "شارلیز ترون", "آمی آدامز", "ناتالی پورتمن",
        "جنیفر لارنس", "اسکارلت جوهانسون", "کریس همسورث", "تام کروز",
        "هریسون فورد", "دنیل دی-لوئیس", "کاترین هپبورن", "بت دیویس",
        "هیومفری بوگارت", "جری لوئیس", "دین مارتین", "فرانک سیناترا",
        "سیدنی پواتیه", "گریگوری پک", "شان کانری", "روجر مور",
        "تیموتی دالتون", "پیرس بروسنان", "دنیل کریگ", "اورسن ولز",
        "چارلی چاپلین", "باستر کیتون", "هارولد لوید", "فرد آستر",
        "جین کلی", "بنگ کرازبی", "باب هوپ", "رابرت میچام",
        "جان وین", "کلارک گیبل", "گری کوپر", "سپنسر تریسی",
        "لارنس اولیویه", "ریچارد برتون", "پیتر اوتول", "آلبرت فینی",
        "مایکل کین", "شان پن", "راسل کرو", "مت دیمون",
        "بن افلک", "جرج کلونی", "بروس ویلیس", "ارنولد شوارتزنگر",
        "سیلوستر استالونه", "جیسون استاتهام", "دواین جانسون", "وین دیزل",
        "کریستوف والتز", "خاویر باردم", "بنیسیو دل تورو", "خواکین فینیکس",
        "ادی ردمین", "بندیکت کامبربچ", "تام هاردی", "کریس پرت",
        "آدم درایور", "جان گودمن", "جف بریجز", "کوین اسپیسی",
        "روبین ویلیامز", "جیم کری", "استیو کارل", "ویل فرل",
        "بن استیلر", "جک بلک", "ساشا بارون کوهن", "پل راد",
        "ست روگن", "جیمز فرانکو", "دنی مک‌براید", "کریگ رابینسون",
        "جانا هیل", "مایکل سرا", "کریستوفر مینتز-پلاسه", "جونا بابو"
    ]
    var categoryTechArray = [
        "فیزیک", "شیمی", "زیست‌شناسی", "نجوم", "ریاضیات",
        "جبر", "هندسه", "مکانیک کوانتومی", "نسبیت عام", "نسبیت خاص",
        "بیوتکنولوژی", "ژنتیک", "فتوسنتز", "اکولوژی", "زمین‌شناسی",
        "متابولیسم", "DNA", "RNA", "ایمنی‌شناسی", "نوروساینس",
        "روباتیک", "هوش مصنوعی", "یادگیری ماشین", "الگوریتم", "شبکه عصبی",
        "برنامه‌نویسی", "کدنویسی", "دیتابیس", "کلود کامپیوتینگ", "بلاک‌چین",
        "بیت‌کوین", "کریپتوکارنسی", "سخت‌افزار", "نرم‌افزار", "ماینینگ",
        "سیستم‌عامل", "ویندوز", "مک‌اواس", "لینوکس", "اندروید",
        "آی‌او‌اس", "اپلیکیشن", "وب‌سایت", "آنتی‌ویروس", "امنیت سایبری",
        "رمزنگاری", "وای‌فای", "بلوتوث", "نانوتکنولوژی", "میکروسکوپ",
        "تلسکوپ", "اکسلراتور ذرات", "حسگر", "میکروکنترلر", "رزبری‌پای",
        "آردوینو", "سلول خورشیدی", "انرژی تجدیدپذیر", "توربین بادی", "پنل خورشیدی",
        "باتری لیتیوم-یون", "اقیانوس‌شناسی", "پالئونتولوژی", "فیزیک ذرات", "فیزیک کلاسیک",
        "کوانتوم الکترودینامیک", "کوانتوم کرومودینامیک", "فیزیک نجومی", "فیزیک پلاسما", "فیزیک حالت جامد",
        "تکنولوژی لیزر", "فیبر نوری", "سیلیکون", "ترانزیستور", "مدار مجتمع",
        "واقعیت مجازی", "واقعیت افزوده", "چاپ سه‌بعدی", "بیومتریک", "رادار",
        "سونار", "درون", "تشعشعات الکترومغناطیسی", "سیاهچاله", "کهکشان",
        "سحابی", "ستاره‌شناسی", "پلانکتون", "ایکولوژی", "محیط زیست",
        "تغییرات آب‌وهوایی", "گرمایش جهانی", "انقراض", "تکامل", "انتخاب طبیعی",
        "جاوا", "پایتون", "سی‌شارپ", "جاوااسکریپت", "ری‌اکت",
        "تجزیه و تحلیل داده", "هوش تجاری", "سیستم‌های توصیه‌گر", "پردازش زبان طبیعی", "تشخیص گفتار",
        "شبیه‌سازی", "مدل‌سازی", "بیگ دیتا", "کلان داده", "داده‌کاوی",
        "آلودگی هوا", "فتوسنتز مصنوعی", "بیوفیلتر", "روشنایی LED", "طراحی پایدار",
        "گیاهان تراریخته", "ژنوم انسان", "تحقیقات سلول‌های بنیادی", "بیوانفورماتیک", "زیست‌فناوری پزشکی"
    ]
    var categoryGeneralArray = ["آتش به اختیار", "نخل خرما", "قوری گل قرمزی", "گستاخ", "زن دوم شاپور اول", "استفنائات", "مرخصی زایمان", "فروگذار", "مثال نقض", "اقتدار ملی", "امنیت ملی", "مخرج مشترک", "بی‌وقفه", "افشاگری", "منصفانه", "همت مضاعف", "سندرم دان", "کمیته جبهه ملی", "پین کد", "چتر نجات", "ماشین مشتی ممدلی", "بازار بزرگ مبل", "قطار سریع‌السیر", "ماموریت غیر ممکن", "فرش شفقی تبریز", "کان لم یکن", "مراسم توپ طلا", "نمایشگاه بهاره", "جذر و مد", "هندوانه شب چله", "تیاتر کمدی", "سود خالص", "پانتومیم", "صنف چلو کباب", "صحن حرم", "سی تی اسکن", "ایزوگام پشت بوم", "وجدان بیدار", "جامدادی زیپی", "یوبوست", "پانکراس", "یاتاقان", "ارولوژیست", "هردنبیل", "قابله", "مانیکور", "سمبل مقاومت", "وقاحت", "ازگیل", "داعش", "شلوارک نخی", "نخل خرما", "پهباد", "کشمش پلویی", "ملیله دوزی", "فلج مادر زاد", "بی مروت", "پروتکل الحاقی", "اسفند ماه", "پیژامه راه راه", "وادی عرفان", "تفتیش عقاید", "انبر نسارا", "مقررات نظامی", "در حال توسعه", "حمله سایبری", "پلیس فتا", "شیر هموژنیزه", "کلیسای واتیکان", "کرومزوم", "وال استریت", "کاتولیک", "سیاست خارجی", "بواسیر", "ساکشن", "وازکتومی", "همسایه فضول", "پاچه خواری", "شیاف", "سوسول بازی", "قاتل بروسلی", "شرت مامان دوز", "جادوگر شهر از", "سرباز ترسو", "بادیه نشین", "سفید برفی", "لوک خوش", "پاپیروس", "شدادگاه تجدید نظر", "دادستان عمومی", "چهار شنبه سوری پارسال", "روح اموات", "سفرنامه مارکوپلو", "نازک نارنجی", "رستوران مکزیکی", "گل گاو زبان", "ناتالی پرتمن", "مخبر الدوله سر سعدی", "شتر گاو پلنگ", "دار المجانین", "نراق", "سازمان ملل متحد", "لوز المعده", "استکبار جهانی", "غسل جنابت", "ایالات متحده", "سلیطه", "فراماسونری", "آلوئه ورا", "انرژی هسته ای", "قاره آفریقا", "بیمه عمر", "سلطان غم مادر", "قزن قفلی لباس", "سه راه سلفچگان", "ایزوگام", "روح خورزو خان", "رنگین کمان", "ایزی لایف", "حرکت با دنده سنگین", "لاتاری", "دل خسته", "آسایش", "ابتکار", "ابوالهل", "داف", "پرین", "مادر بزرگ شنل قرمزی", "خانواده دکتر ارنست", "شاخ به شاخ", "پدر پسر شجاع", "اسکله", "کارآفرین", "شناسنامه", "سیمرغ", "داروخانه", "سیانور", "دومینو", "هولوکاست", "ایزوگام", "مجسمه ابوالهول", "منگل", "آبگوشت مشتی", "کارنامه", "اختاپوس", "حنابندان", "دورنما", "خرناس", "تابلو لبخند مونالیزا", "شیطان", "اسب تروا", "دختر شاه پریان", "نیمکت ذخیره", "کلاه قرمزی و پسر خاله", "رژ گونه صورتی", "دستمال کاغذی عطری", "آینه و شمعدان عروس", "پرده کرکره", "اسهال خونی", "تاجر ونیزی", "ارباب رجوع", "ایستگاه صلواتی", "غذای حضرتی", "سوپاپ اطمینان", "ستاره سهیل", "نفس باد صبا", "جنگل اسرار آمیز", "بده در راه خدا", "مرخصی بدون حقوق", "اضافه حقوق", "سازمان ملل متحد", "منشور کوروش", "حوزه استحفاظی کلانتری", "مدیر منابع انسانی", "کوچه علی چپ", "واشر سر سیلندر", "تشریفات", "بریز و بپاش", "مهمان ناخوانده", "شب نشینی", "جنگ و صلح", "بوی پیراهن یوسف", "صبر ایوب", "مدار صفر درجه", "خط استوا", "جزیره متروکه", "سلطان غم مادر", "رفیق بی کلک مادر", "خواننده زیر زمینی", "آهنگ شیش و هشت", "پشمک حاج عبدالله", "عین هلو", "درخت اکالیپتوس", "زبان مادر شوهر", "باجناق همسایه", "میگو سوخاری", "استکبار ستیزی", "جنگ نرم"]
    var categoryMashahirArray = ["جورج الیور می", "رابرت هیستر مونتگمری", "ویلیام آندرو پتن", "آرتور لوئز دیکینسون", "هنری راند هاتفیلد", "الیا وات سلز", "ویکتور هرمان استمپ", "آرتور ادوارد اندرسن", "توماس کلمن آندروز", "چارلز ازرا اسپراگ", "ژوزف ادموند استرت", "کارمن ژرژ بلاف", "ساموئل جان برود", "توماس هنری ساندرز", "هیرمان تامپسون اسکویل", "پرسیوال فلک براندیج", "آنانیاس چارلز لیتلتون", "روی برنارد کستر", "هرمان کلینتون میلر", "هاری آنسون فینی", "آرتور بوین فویه", "رونالد پوتنام پری", "مارکویز ژرژ ایتون", "موریس هوبرت استافن", "اریک لوئیس کهلر", "اندرو بار", "لوید موری", "پل فرانکلین گراری", "پری امپی ماسون", "جیمز لورینگ پی‌یرس", "ژرژ داویس بیلی", "جان لانسینگ کری", "ویلیام ولینگ ورنتز", "رابرت مارتین تروبلاد", "لئونارد پل اسپاچک", "جان ویلیام کوئینان", "هوارد ایروین راس", "رابرت کهن ماتز", "موریس مونیتز", "مارشال اسمیت آرمسترانگ", "المر بوید استاتس", "هربرت المر میلر", "سیدنی داویدسون", "هنری الکساندر بنسون", "ابوالقاسم فردوسی", "ابن سینا", "سعدی شیرازی", "ابوحامد محمد غزالی", "خواجه عبدالله انصاری", "حافظ شیرازی", "صائب تبریزی", "خیام", "عبدالرحمان محمد جامی", "نیما یوشیج", "محمدباقر مجلسی", "ابوالوفا محمد بوزجانی", "امیرکبیر", "خواجه نصیرالدین طوسی", "ابوالحسن صبا", "حکیم ناصرخسرو", "امام محمد غزالی", "شیخ بهایی", "خواجه نصیرالدین طوسی", "قطب‌الدین شیرازی", "مولانا عبدالعلی بیرجندی", "ابوسعید ابوالخیر", "میر سید علی همدانی"]
    var categoryProverbArray = [ "اینهمه خر هست و ما پیاده میریم !", "از شیر مرغ تا جان آدمیزاد !", "آدم گدا، این همه ادا؟", "آستین نو، پلو بخور !", "آسیاب به نوبت !", "آش با جاش !", "آش نخورده و دهن سوخته !", "عیسی به دین خود، موسی به دین خود !", "سنگین برو، سنگین بیا !", "توبه گرگ مرگ است !", "کلاهت را قاضی کن !", "خود کرده را تدبیر نیست !", "ضرب المثل شریک دزد و رفیق قافله !", "دل به دل راه دارد !", "کار از محکم کاری عیب نمی‌کند !", "بار کج به منزل نمی‌رسد !", "از کوزه همان برون تراود که در اوست !", "آفتابه لگن هفت دست شام و ناهار هیچی !", "بذار در کوزه آبش را بخور !", "بزک نمیر بهار میاد کمبزه خیار میاد !", "مرگ یه بار شیونم یه بار !", "بالاتر از سیاهی رنگی نیست !", "با دمش گردو می شکنه !", "پیش قاضی و معلق بازی !", "پارسال دوست امسال آشنا !", "مال بد بیخ ریش صاحبش !", "ﻣﺎﺭ تو ﺁﺳﺘﯿﻦ پرورش دادن !", "گاوش زائیده !", "موشو تو آسیا سفید نکرده !", "از هر چه بدم اوم سرم اومد !", "جواب ابلهان خاموشیست !", "جایی نمی خوابه که آب زیرش بره !", "جانماز آب کشیدن !", "خدا خرو شناخت شاخش نداد !", "از این ستون به آن ستون فرج است !", "به مرگ میگیره تا به تب راضی بشه !", "سحرخیز باش تا کامروا شوی !", "این به اون در !", "اجاره نشین خوش نشینه !", "خواهی نشوی رسوا هم رنگ جماعت شو !", "تا گوساله گاو شود ، دل صاحبت آب شود !", "از هر چی بدت بیاد ، سرت میاد !", "تیشه به ریشه زدن !", "از اسب افتاده ایم، اما از نسل نیفتاده ایم !", "از اونجا مونده، از اینجا رونده !", "از اون نترس که های و هوی داره، از اون بترس که سر به تو داره !!", "از این امامزاده کسی معجز نمی بینه !!", "از این دم بریده هر چی بگی بر میاد !!", "از این ستون بآن ستون فرجه !", "از بی کفنی زنده ایم !", "از دست پس میزنه، با پا پیش میکشه !", "از تنگی چشم پیل معلومم شد ، آنانکه غنی ترند محتاج ترند !", "از تو حرکت، از خدا برکت .!", "از حق تا نا حق چهار انگشت فاصله است !", "از خر افتاده، خرما پیدا کرده !", "از خرس موئی، غنیمته !", "از خر میپرسی چهارشنبه کیه ؟!", "از خودت گذشته، خدا عقلی به بچه هات بده !", "از درد لا علاجی به خر میگه خانمباجی !!", "از دور دل و میبره، از جلو زهره رو !!", "از سه چیز باید حذر کرد، دیوار شکسته، سگ درنده، زن سلیطه !", "از شما عباسی، از ما رقاصی !", "از کوزه همان برون تراود که در اوست !", "از کیسه خلیفه می بخشه !", "از گدا چه یک نان بگیرند و چه بدهند !", "از گیر دزد در آمده، گیر رمال افتاد !", "از ماست که بر ماست !", "از مال پس است و از جان عاصی !", "از مردی تا نامردی یک قدم است !", "از من بدر، به جوال کاه !", "از نخورده بگیر، بده به خورده !", "از نو کیسه قرض مکن، قرض کردی خرج نکن !", "از هر چه بدم اومد، سرم اومد !", "از هول هلیم افتاد توی دیگ !", "از یک گل بهار نمیشه !", "از این گوش میگیره، از آن گوش در میکنه !", "اسباب خونه به صاحبخونه میره !", "اسب پیشکشی رو، دندوناشو نمیشمرند !", "هم از توبره میخوره هم ازآخور !", "اسب دونده جو خود را زیاد میکنه !", "اسب را گم کرده، پی نعلش میگرده !", "اسب و خر را که یکجا ببندند، اگر همبو نشند همخو میشند !", "استخری که آب نداره، اینهمه قورباغه میخواد چکار ؟ !", "اصل کار برو روست، کچلی زیر موست !", "اکبر ندهد، خدای اکبر بدهد !", "جیک جیک مستونت بود ، فکر زمستوتونت بود؟ !", "اگر بیل زنی، باغچه خودت را بیل بزن !", "اگر برای من آب نداره، برای تو که نان داره !", "اگر بپوشی رختی، بنشینی به تختی، تازه می بینمت بچشم آن وختی !", "اگه باباشو ندیده بود، ادعای پادشاهی میکرد !", "اگه پشیمونی شاخ بود، فلانی شاخش بآسمان میرسید !", "اگه تو مرا عاق کنی، منهم ترا عوق میکنم !", "اگر جراحی، پیزی خود تو جا بنداز !", "اگه خدا بخواهد، از نر هم میدهد !", "ارزان خری، انبان خری !", "اگه خاله ام ریش داشت، آقا دائیم بود !", "اگه خیر داشت، اسمشو می گذاشتند خیرالله !", "اگر دانی که نان دادن ثواب است — تو خود میخور که بغدادت خرابست !", "اگه دعای بچه ها اثر داشت، یک معلم زنده نمی موند !", "اگه زاغی کنی، روقی کنی، میخورمت !","اگه زری بپوشی، اگر اطلس بپوشی، همون کنگر فروشی !", "گه علی ساربونه، میدونه شترو کجا بخوابونه !", "اگه کلاغ جراح بود، ماتحت خودشو بخیه میزد !", "اگه لالائی بلدی، چرا خوابت نمیبره !", "اگه لر ببازار نره بازار میگنده !", "اگه مردی، سر این دسته هونگ ( هاون ) و بشکن !", "اگه بگه ماست سفیده، من میگم سیاهه !", "اگه مهمون یکی باشه، صاحبخونه براش گاو می کشه !", "اگه نخوردیم نون گندم، دیدیم دست مردم !", "اگه نی زنی چرا بابات از حصبه مرد !", "اگه هفت تا دختر کور داشته باشه، یکساعته شوهر میده!", "اگه همه گفتند نون و پنیر، تو سرت را بگذار زمین و بمیر !", "امان از خانه داری، یکی میخری دو تا نداری!", "امان ازدوغ لیلی ، ماستش کم بود آبش خیلی !", "انگور خوب، نصیب شغال میشه !", "اوسا علم ! این یکی رو بکش قلم !", "اولاد، بادام است اولاد اولاد، مغز بادام !", "اول بچش، بعد بگو بی نمکه !", "اول برادریتو ثابت کن، بعد ادعای ارث و میراث کن !", "اول بقالی و ماست ترش فروشی !", "اول پیاله و بد مستی !", "اول ، چاه را بکن، بعد منار را بدزد !", "ای آقای کمر باریک، کوچه روشن کن و خانه تاریک !", "این تو بمیری، از آن تو بمیری ها نیست !", "اینجا کاشون نیست که کپه با فعله باشه !", "این قافله تا به حشر لنگه !", "اینکه برای من آوردی، ببر برای خاله ات !", "اینو که زائیدی بزرگ کن !", "این هفت صنار غیر از اون چارده شی است !", "اینهمه چریدی دنبه ات کو ؟!", "این تو بمیری از اون تو بمیری ها نیست !", "شاه بخشید شاه غلام نمیبخشه !"
    ]
    var RArray = ["آلت تناسلی", "بخورش","بمال","بپرروش","کونی","بکارت","بکن توش","بکنش","بکنمت","بی پدر","بیابخورش","بیناموس","تخم سگ","تخمی","توله سگ","جاکش","جلق زدن","جنده","جنسی","جوون”,”حرومزاده","حشری شدن","خارکس ده","خانم جنده","خایه خور","داگ استایل","گاییده","دهنت سرویس","دوجنسه","دول","دیوث","دیوس خان","زنا زاده","ساک","سرخور","سکس چت","سیکتیر","شق کردن","شهوتی","صیغه ای","صیک","عمتو","عمه ننه","عن تر","غرمصاق","فاحشه خانم","فاک فیس","فیلم سوپر","لا پا","لاس","لاش گوشت","لاشی","لز","مادر جنده","مادرسگ","مادرقهوه","مادرکونی","مالوندن","ماچ کردنی","ممه خور","میخوریش","نرکده","نگاییدم","هیز","پدر صلواتی","پفیوز","پورن","چاغال","چس خور","کردنی","کس خل","کس خور","کس خیس","کس ننت","کس کش","کسخل","کسشعر","کسکش","کص خل","کص لیس","کلفت","کله کیری","کون تپل","کون ده","کون پنیر","کونده خوار","کونده","کیردوس","گشاد","گی زن","باسنی","سیکیم","سگ ناموس","مفعول","قمبل","مادر به خطا","نوب","اوبی"]
    
    var RadjectivesArray = ["بامزه", "دیوانه", "شیطون", "خنده‌دار", "شاد", "ماجراجو", "کنجکاو", "دوست‌داشتنی", "عجیب", "گیج", "سرزنده", "بلندپرواز", "خلاق", "سرخوش", "پرشور", "مرموز", "نقلی", "شوخ", "پرانرژی", "غیرمعمولی", "کمیک", "بی‌خیال", "بی‌قرار", "پرحرف", "بازیگوش", "جسور", "نترس", "بی‌پروا", "پرجنب‌وجوش", "سریع‌الوجه", "خوش‌خیال", "خوش‌مشرب", "بی‌ملاحظه", "پرتوقع", "خودشیفته", "منحصربه‌فرد", "فضول", "بی‌قانون", "خودرأی", "بی‌نظم", "دست‌وپاچلفتی", "پرحادثه", "ناشی", "ساده‌لوح", "خودبین", "فانتزی", "غیرقابل‌پیش‌بینی", "ریسک‌پذیر", "پرطمطراق", "پرسروصدا", "متفاوت", "باهوش", "شگفت‌انگیز", "غیرعادی", "بی‌پروا", "جالب", "خنگول", "پرخاشگر", "پرتحرک", "پیچیده", "خودباور", "شلوغ", "گیج", "شنگول", "پرت", "خنده‌دار", "کنجکاو", "دیوانه‌وار", "کج‌خلق", "پرشور", "جذاب", "پرحرف", "خوش‌خیم", "خیال‌پرداز", "نقاش‌مسلک", "بازیگوش", "بی‌پروا", "بذله‌گو", "پرتقالی", "بی‌قرار", "خودشیفته", "ماجراجو", "عاشق‌پیشه", "سرخوش", "شیطان", "زرنگ", "شوریده", "هنرمند", "عجیب", "معجزه‌آسا", "پیچیده", "گردباد", "کوکی", "آشوبگر", "فضول", "نازک‌نارنجی", "شوخ‌طبع", "تودل‌برو", "خوش‌مزه", "قاطی‌پاتی", "کلافه", "دلربا", "مرموز", "رمانتیک", "شکلاتی", "مهربان", "بی‌نظیر", "آرامش‌بخش", "حواس‌پرت", "خوشبخت", "فانتزی", "شیرین‌زبان", "پرهیجان", "دل‌انگیز", "محیرالعقول", "نازنین", "اوهامی", "گنگ", "شاعرانه", "مغزپسته‌ای", "آفتابی", "پیک‌نیکی"]
    var categoryRandomArray = [String]()
    
    override var preferredStatusBarStyle: UIStatusBarStyle {
        return .lightContent
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        UIApplication.shared.isIdleTimerDisabled = true
        categoryNameLabel.text = delegate?.category()
        timer = GameViewController.time
        countdownLabel.text = formatTime(timer)
        randomWord()
        finishButton.isHidden = true
    }
    
    func randomWord() {
        
        if UserDefaults.standard.bool(forKey: "+18Word") {
            categoryRandomArray = animalArray + objectArray + foodArray + categoryFootballArray + categorySportArray + categoryMovieArray + categoryJobArray + categoryPlaceArray + categoryTechArray + categoryCelebrityArray + categoryMusicArray + categoryBookArray + categoryCountryCityArray + categoryProverbArray + categoryMashahirArray + categoryGeneralArray
        } else {
            categoryRandomArray = RArray + animalArray + objectArray + foodArray + categoryFootballArray + categorySportArray + categoryMovieArray + categoryJobArray + categoryPlaceArray + categoryTechArray + categoryCelebrityArray + categoryMusicArray + categoryBookArray + categoryCountryCityArray + categoryProverbArray + categoryMashahirArray + categoryGeneralArray
        }
        
        switch delegate?.category() {
        case "رندم":
            randomWordLabel.text = categoryRandomArray.randomElement()!
        case "+18":
            randomWordLabel.text = RArray.randomElement()! + " " + RadjectivesArray.randomElement()!
        case "حیوان":
            randomWordLabel.text = animalArray.randomElement()! + " " + animaladjectivesArray.randomElement()!
        case "اشیا":
            randomWordLabel.text = objectArray.randomElement()! + " " + objectAdjectiveArray.randomElement()!
        case "غذا":
            randomWordLabel.text = foodArray.randomElement()! + " " + foodAdjectivesArray.randomElement()!
        case "فوتبال":
            randomWordLabel.text = categoryFootballArray.randomElement()!
        case "ورزشی":
            randomWordLabel.text = categorySportArray.randomElement()!
        case "فیلم سریال":
            randomWordLabel.text = categoryMovieArray.randomElement()!
        case "شغل":
            randomWordLabel.text = categoryJobArray.randomElement()!
        case "اماکن":
            randomWordLabel.text = categoryPlaceArray.randomElement()!
        case "تکنولوژی":
            randomWordLabel.text = categoryTechArray.randomElement()!
        case "سلبریتی":
            randomWordLabel.text = categoryCelebrityArray.randomElement()!
        case "موزیک":
            randomWordLabel.text = categoryMusicArray.randomElement()!
        case "کتاب":
            randomWordLabel.text = categoryBookArray.randomElement()!
        case "شهر کشور":
            randomWordLabel.text = categoryCountryCityArray.randomElement()!
        case "ضرب المثل":
            randomWordLabel.text = categoryProverbArray.randomElement()!
        case "مشاهیر":
            randomWordLabel.text = categoryMashahirArray.randomElement()!
        case "عمومی":
            randomWordLabel.text = categoryGeneralArray.randomElement()!
        default:
            randomWordLabel.text = categoryRandomArray.randomElement()!
        }
    }
    
    @IBAction func PlayButtonTapped(_ sender: UIButton) {
        startTimer()
        playButton.isHidden = true
        finishButton.isHidden = false
        addTimeButton.isEnabled = false
        changeWordButton.isEnabled = false
    }
    
    @IBAction func finishButtonTapped(_ sender: UIButton) {
        
        endTimer()
    }
    
    @IBAction func changeWordButtonTapped(_ sender: UIButton) {
        randomWord()
        changeWordButtonFlag += 1
        scoreResultNumber -= 1
        
        if changeWordButtonFlag == 1 {
            changeWordButton.isEnabled = false
        }
    }
    
    @IBAction func addTimeButtonTapped(_ sender: UIButton) {
        countdownLabel.text = formatTime(GameViewController.time+30)
        addTimeButton.isEnabled = false
        scoreResultNumber -= 1
    }
    
    func startTimer() {
        countdownTimer = Timer.scheduledTimer(timeInterval: 1.0, target: self, selector: #selector(updateTimer), userInfo: nil, repeats: true)
    }
    
    @objc func updateTimer() {
        if timer > 0 {
            timer -= 1
            countdownLabel.text = formatTime(timer)
        } else {
            endTimer()
        }
    }
    
    func formatTime(_ totalSeconds: Int) -> String {
        let minutes = totalSeconds / 60
        let seconds = totalSeconds % 60
        return String(format: "%02d:%02d", minutes, seconds)
    }
    
    func endTimer() {
        countdownTimer?.invalidate()
        countdownTimer = nil
        gameResultAlert()
        gameResultCalculate()
    }
    
    func gameResultAlert() {
        
        let alert = UIAlertController(title: "Time is over!", message: "Did you answer correctly?", preferredStyle: .alert)
        alert.addAction(UIAlertAction(title: "No", style: .cancel, handler: {  (alertAction) in
            self.scoreResultNumber = 0
            self.showResultInGamePage()
        }))
        
        alert.addAction(UIAlertAction(title: "Yes", style: .destructive, handler: {(alertAction) in
            
            if self.categoryNameLabel.text == "ضرب المثل" {
                self.scoreResultNumber += 5
            }
            self.showResultInGamePage()
        }))
        self.present(alert, animated: true)
    }
    
    func gameResultCalculate() {
        
        GameViewController.roundNumber += 1
        UserDefaults.standard.set(GameViewController.roundNumber, forKey: "roundNumer")
        GameViewController.currentIndexFlag += 1
        
        if UserDefaults.standard.integer(forKey: "roundNumer") % GameViewController.groupNumber == 0 {
            GameViewController.newRoundNumer += 1
            UserDefaults.standard.set(GameViewController.newRoundNumer, forKey: "newRoundNumer")
            GameViewController.newRoundNumer = UserDefaults.standard.integer(forKey: "newRoundNumer")
        } else {
            GameViewController.newRoundNumer = UserDefaults.standard.integer(forKey: "newRoundNumer")
        }
    }
    
    func showResultInGamePage() {
        
        for controller in self.navigationController!.viewControllers as Array {
            if let vc = controller as? GameViewController {
                vc.Score_NewRoundNumberDelegate = self
                self.navigationController!.popToViewController(vc, animated: true)
                break
            }
        }
    }
}

extension PlayViewController: Score_NewRoundNumberDelegate {
    
    func setScoreNumber() -> Int {
        return scoreResultNumber
    }
    
    func newRoundNumber() -> Int {
        return GameViewController.newRoundNumer
    }
    
    func newCurrentIndex() -> Int {
        return GameViewController.currentIndexFlag
    }
}
